In [6]:
import pandas as pd
import numpy as np

# 输出版本号

In [3]:
pd._version

# 从列表创建Series

In [4]:
arr = [0,1,2,3,4]
df = pd.Series(arr)
df

0    0
1    1
2    2
3    3
4    4
dtype: int64

# 从字典创建Series

In [5]:
d = {'a':1,'b':2,'c':2}
df = pd.Series(d)
df

a    1
b    2
c    2
dtype: int64

# 从 NumPy 数组创建 DataFrame

In [16]:
dates = range(1,7)
num_arr = np.random.randn(6,4)
columns = ['A','B','C','D']
df = pd.DataFrame(num_arr,index=dates,columns=columns)
df

          A         B         C         D
1  0.235799  0.750982 -0.337098  2.892531
2  0.645586  0.356385  0.394754  0.265634
3  1.034447  0.190845 -0.296074 -0.486962
4  0.181716  0.189918  0.859687 -0.723831
5 -1.860353 -0.998673 -0.934171  0.250626
6  0.660646 -1.647602  0.007323 -1.221241

# 从 字典对象 创建 DataFrame，字典键作为columns,在自定义index

In [55]:
data = {'a':[11,21,31],'b':[123,123,312]}
index = [1,2,3]
df = pd.DataFrame(data,index=index)
df

    a    b
1  11  123
2  21  123
3  31  312

# 展示了index数量为3，columns数量为2，每一列值有3个，类型为int64

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
dtypes: int64(2)
memory usage: 72.0 bytes

# 展示df的前2行

In [28]:
df.iloc[:2]

    a    b
1  11  123
2  21  123

# 展示df的第3行

In [29]:
df.iloc[2]

a     31
b    312
Name: 3, dtype: int64

# 展示df的a列

In [30]:
df.loc[:,['a']]

    a
1  11
2  21
3  31

# 展示df的a列的前两行

In [31]:
df.loc[:2,['a']]

    a
1  11
2  21

# 取出索引为2，1行的b列，顺序为2，1

In [35]:
df.loc[df.index[[2,1]],['b']]

     b
3  312
2  123

# 展示df的a列的value

In [36]:
df['a']

1    11
2    21
3    31
Name: a, dtype: int64

# 取出a的值大于20的行

In [37]:
df[df['a']>20]

    a    b
2  21  123
3  31  312

# 取出a的值为NULL行

In [38]:
df[df['a'].isnull()]

Empty DataFrame
Columns: [a, b]
Index: []

# 取出a的值大于11并且小于140的行

In [49]:
df[(df['a']>11)&(df['b']<140)]

    a    b
2  21  123

In [56]:
df

    a    b
1  11  123
2  21  123
3  31  312

# 将索引2的a值改为10，注意索引为int还是str

In [59]:
df.loc[2,'a']= 10

In [60]:
df

      a      b
1  11.0  123.0
2  10.0  123.0
3  31.0  312.0
2  10.0    NaN

# 计算a列的总和

In [61]:
df['a'].sum()

62.0

# 定义一个栗子

In [63]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
af = pd.DataFrame(data, index=labels)
af

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

# 按照animal分类，计算age平均值

In [64]:
af.groupby('animal')['age'].mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

# 按照animal分类，统计数量

In [65]:
af['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

# 先按照age和后按照visits分类，age按照降序，visits按照升序

In [66]:
af.sort_values(by=['age','visits'],ascending=[False,True])

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  2.0       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

# 将priority列中的yes, no替换为布尔值True, False

In [ ]:
af['priority'] = af['priority'].map({'yes': True, 'no': False})
af

# 重新给priority赋值

In [75]:
af['priority'] = ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']

In [76]:
af

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

# 将animal列中的snake替换为python

In [78]:
af['animal'] = af['animal'].replace('snake', 'python')

In [79]:
af

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c  python  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g  python  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no

# 对每种animal的每种不同数量visits，计算平均age，即，返回一个表格，行是aniaml种类，列是visits数量，表格值是行动物种类列访客数量的平均年龄

In [80]:
af.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
python  4.5  0.5  NaN

# any列赋值为0

In [81]:
af['any'] = 0

In [82]:
af

   animal  age  visits priority  any
a     cat  2.5       1      yes    0
b     cat  3.0       3      yes    0
c  python  0.5       2       no    0
d     dog  NaN       3      yes    0
e     dog  5.0       2       no    0
f     cat  2.0       3       no    0
g  python  4.5       1       no    0
h     cat  NaN       1      yes    0
i     dog  7.0       2       no    0
j     dog  3.0       1       no    0

# 删除any列

In [88]:
af = af.drop('any',axis=1)
af

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c  python  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g  python  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no

# 增加k行

In [89]:
af.loc['k'] = [5.5,'dog','no',2]
af

   animal  age visits priority
a     cat  2.5      1      yes
b     cat    3      3      yes
c  python  0.5      2       no
d     dog  NaN      3      yes
e     dog    5      2       no
f     cat    2      3       no
g  python  4.5      1       no
h     cat  NaN      1      yes
i     dog    7      2       no
j     dog    3      1       no
k     5.5  dog     no        2

# 删除k行

In [95]:
af = af.drop('k')
af

   animal  age visits priority
a     cat  2.5      1      yes
b     cat    3      3      yes
c  python  0.5      2       no
d     dog  NaN      3      yes
e     dog    5      2       no
f     cat    2      3       no
g  python  4.5      1       no
h     cat  NaN      1      yes
i     dog    7      2       no
j     dog    3      1       no

# 进阶篇